constant/air/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/air/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          556;
        startFace       201996;
    }
    outlet
    {
        type            patch;
        nFaces          556;
        startFace       202552;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2223;
        startFace       203108;
    }
    air_to_solid
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          19368;
        startFace       205331;
        sampleMode      nearestPatchFace;
        sampleRegion    solid;
        samplePatch     solid_to_air;
    }
)

// ************************************************************************* //
