system/Probes_Solid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

region solid;

fields (T);

writeControl    timeStep;
writeInterval   50;

probeLocations
(
    (0.005 0.005 0.009)
    (0.005 0.005 0.007)
    (0.005 0.005 0.005)
    (0.005 0.005 0.003)
    (0.005 0.005 0.001)
);

// ************************************************************************* //
