system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

// Cote du cube [m]
BoiteCote 0.01;    

//  Taille de maille Level 0 suivant x y et z
lx 0.0005;    
ly 0.0005;    
lz 0.0005;    

//  Boite blockMesh définie avec un débord de 10% (1mm)
xMin -0.001;
yMin -0.001;
zMin -0.001;

xMax #calc "$BoiteCote+0.001";
yMax #calc "$BoiteCote+0.001";
zMax #calc "$BoiteCote+0.001";

xcells #calc "round(($xMax-($xMin))/$lx)";
ycells #calc "round(($yMax-($yMin))/$ly)";
zcells #calc "round(($zMax-($zMin))/$lz)";



vertices
(
    ($xMin $yMin $zMin) // vertex number 0
    ($xMax $yMin $zMin) // vertex number 1
    ($xMax $yMax $zMin) // vertex number 2
    ($xMin $yMax $zMin) // vertex number 3
    ($xMin $yMin $zMax) // vertex number 4
    ($xMax $yMin $zMax) // vertex number 5
    ($xMax $yMax $zMax) // vertex number 6
    ($xMin $yMax $zMax) // vertex number 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($xcells $ycells $zcells) simpleGrading (1 1 1)
);

edges
(
);

defaultPatch
{
    type empty;
    name default;
}

boundary
(
);

// ************************************************************************* // 
