system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

baffles
{
    baffles1
    {
        type        faceZone;
        zoneName    air_to_solid;

        patches
        {
            master
            {
                name        air_to_solid;
                type        mappedWall;
                sampleMode  nearestPatchFace;
                sampleRegion solid;
                samplePatch solid_to_air;
            }
            slave
            {
                name        solid_to_air;
                type        mappedWall;
                sampleMode  nearestPatchFace;
                sampleRegion air;
                samplePatch air_to_solid;
            }
        }
    }
}


// ************************************************************************* //
