system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          snappyHexMeshDict;
}

castellatedMesh on;

snap            on;

addLayers       on;

castellatedMeshControls
{
    maxLocalCells   100000;
    maxGlobalCells  100000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.1;
    nCellsBetweenLevels 3;
    resolveFeatureAngle 15;
    allowFreeStandingZoneFaces true;
    features        ( { file "box_walls.eMesh" ; level 0 ; } );
    refinementSurfaces
    {
        sphere
        {
            level           ( 2 2 );
            faceZone        sphere_surface;
            cellZone        solid;
            cellZoneInside  insidePoint;
            insidePoint     ( 0.005 0.005 0.005 );
        }
        box_walls
        {
            level           ( 0 0 );
            regions
            {
                inlet
                {
                    level           ( 0 0 );
                    patchInfo
                    {
                        type            patch;
                    }
                }
                outlet
                {
                    level           ( 0 0 );
                    patchInfo
                    {
                        type            patch;
                    }
                }
                walls
                {
                    level           ( 0 0 );
                    patchInfo
                    {
                        type            wall;
                    }
                }
            }
        }
    }
    refinementRegions
    {
    }
    locationsInMesh ( ( ( 0.005 0.005 0.005 ) solid ) ( ( 0.001 0.001 0.001 ) air ) );
}

snapControls
{
    nSmoothPatch    3;
    tolerance       2;
    nSolveIter      100;
    nRelaxIter      5;
    nFeatureSnapIter 10;
    explicitFeatureSnap false;
    multiRegionFeatureSnap false;
    implicitFeatureSnap true;
}

addLayersControls
{
    featureAngle    100;
    slipFeatureAngle 30;
    nLayerIter      50;
    nRelaxedIter    20;
    nRelaxIter      5;
    nGrow           0;
    nSmoothSurfaceNormals 1;
    nSmoothNormals  3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle 90;
    nMedialAxisIter 10;
    nBufferCellsNoExtrude 0;
    additionalReporting false;
    layers
    {
        "sphere"
        {
            nSurfaceLayers  2;
        }
    }
    relativeSizes   true;
    expansionRatio  1.2;
    firstLayerThickness 0.2;
    minThickness    2.5e-05;
}

meshQualityControls
{
    maxNonOrtho     65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave      80;
    minVol          1e-13;
    minTetQuality   1e-15;
    minArea         -1;
    minTwist        0.02;
    minDeterminant  0.001;
    minFaceWeight   0.05;
    minVolRatio     0.01;
    minTriangleTwist -1;
    nSmoothScale    4;
    errorReduction  0.75;
    relaxed
    {
        maxNonOrtho     75;
    }
}

debug           0;

mergeTolerance  1e-06;

geometry
{
    sphere
    {
        type            searchableSphere;
        centre          ( 0.005 0.005 0.005 );
        radius          0.004;
    }
    box_walls.stl
    {
        type            triSurfaceMesh;
        name            box_walls;
        regions
        {
            inlet
            {
                name            inlet;
            }
            outlet
            {
                name            outlet;
            }
            walls
            {
                name            walls;
            }
        }
    }
}


// ************************************************************************* //
