system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // 1. On crée un 'cellSet' (groupe de mailles) nommé "solidSet"
    {
        name    solidSet;
        type    cellSet;
        action  new;
        source  sphereToCell; // On utilise une forme géométrique
        origin  (0 0 0);      // <--- CENTRE DE VOTRE SPHERE (Verifiez vos coords !)
        radius  0.1;         // <--- RAYON DE VOTRE SPHERE (Verifiez la taille !)
    }

    // 2. On convertit ce groupe en "cellZone" (ce que splitMeshRegions comprend)
    {
        name    solid;
        type    cellZone;
        action  new;
        source  setToCellZone;
        set     solidSet;
    }
);

// ************************************************************************* //